In [45]:
import seaborn as sns

In [46]:
df = sns.load_dataset("penguins")
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

In [47]:
df.isnull().sum()

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
dtype: int64

In [56]:
df['bill_lenght_mm']=df['bill_length_mm'].fillna(df['bill_length_mm'].mean())

In [57]:
df['bill_depth_mm']=df['bill_depth_mm'].fillna(df['bill_depth_mm'].mean())

In [58]:
df['body_mass_g']=df['body_mass_g'].fillna(df['body_mass_g'].mean())

In [59]:
df['sex'] = df['sex'].fillna(df['sex'].mode()[0])

In [62]:
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,bill_lenght_mm_,bill_lenght_mm
0,Adelie,Torgersen,39.1,18.70000,181.0,3750.000000,Male,39.10000,39.10000
1,Adelie,Torgersen,39.5,17.40000,186.0,3800.000000,Female,39.50000,39.50000
2,Adelie,Torgersen,40.3,18.00000,195.0,3250.000000,Female,40.30000,40.30000
3,Adelie,Torgersen,NaN,17.15117,NaN,4201.754386,Male,43.92193,43.92193
4,Adelie,Torgersen,36.7,19.30000,193.0,3450.000000,Female,36.70000,36.70000
...,...,...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,17.15117,NaN,4201.754386,Male,43.92193,43.92193
340,Gentoo,Biscoe,46.8,14.30000,215.0,4850.000000,Female,46.80000,46.80000
341,Gentoo,Biscoe,50.4,15.70000,222.0,5750.000000,Male,50.40000,50.40000
342,Gentoo,Biscoe,45.2,14.80000,212.0,5200.000000,Female,45.20000,45.20000
343,Gentoo,Biscoe,49.9,16.10000,213.0,5400.000000,Male,49.90000,49.90000

In [63]:
df.drop('bill_lenght_mm_',axis=1,inplace=True)

In [64]:
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,bill_lenght_mm
0,Adelie,Torgersen,39.1,18.70000,181.0,3750.000000,Male,39.10000
1,Adelie,Torgersen,39.5,17.40000,186.0,3800.000000,Female,39.50000
2,Adelie,Torgersen,40.3,18.00000,195.0,3250.000000,Female,40.30000
3,Adelie,Torgersen,NaN,17.15117,NaN,4201.754386,Male,43.92193
4,Adelie,Torgersen,36.7,19.30000,193.0,3450.000000,Female,36.70000
...,...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,17.15117,NaN,4201.754386,Male,43.92193
340,Gentoo,Biscoe,46.8,14.30000,215.0,4850.000000,Female,46.80000
341,Gentoo,Biscoe,50.4,15.70000,222.0,5750.000000,Male,50.40000
342,Gentoo,Biscoe,45.2,14.80000,212.0,5200.000000,Female,45.20000
343,Gentoo,Biscoe,49.9,16.10000,213.0,5400.000000,Male,49.90000

In [67]:
df.isnull().sum()
df.dropna(axis=1,inplace=True)
df

    species     island  bill_depth_mm  body_mass_g     sex  bill_lenght_mm
0    Adelie  Torgersen       18.70000  3750.000000    Male        39.10000
1    Adelie  Torgersen       17.40000  3800.000000  Female        39.50000
2    Adelie  Torgersen       18.00000  3250.000000  Female        40.30000
3    Adelie  Torgersen       17.15117  4201.754386    Male        43.92193
4    Adelie  Torgersen       19.30000  3450.000000  Female        36.70000
..      ...        ...            ...          ...     ...             ...
339  Gentoo     Biscoe       17.15117  4201.754386    Male        43.92193
340  Gentoo     Biscoe       14.30000  4850.000000  Female        46.80000
341  Gentoo     Biscoe       15.70000  5750.000000    Male        50.40000
342  Gentoo     Biscoe       14.80000  5200.000000  Female        45.20000
343  Gentoo     Biscoe       16.10000  5400.000000    Male        49.90000

[344 rows x 6 columns]

In [68]:
df.isnull().sum()

species           0
island            0
bill_depth_mm     0
body_mass_g       0
sex               0
bill_lenght_mm    0
dtype: int64